{"id": "11059267-3a0d-4954-813c-d7f1ff847cab", "question": "what is the fact of the case of Dss v Agbakoba", "response": "I have conducted a search for Nigerian case law regarding the facts, judicial statements, and decision in the case of *Department of State Services (DSS) v. Agbakoba*. Based on the available information, I will summarize the detailed facts of the case, provide relevant judicial quotes, and outline the decision using a single reliable source. The source I have selected is a legal article from HG.org, which provides a review of the case titled *Case Review: Director of SSS v. Agbakoba*. This source focuses on the legal principles and facts surrounding the case and is suitable for this purpose.\n\n### Detailed Facts of the Case\nThe case of *Director of State Security Services (SSS) v. Agbakoba* revolves around issues of constitutional law, specifically the fundamental human rights of a Nigerian citizen concerning freedom of movement and the right to hold an international passport. The respondent, Olisa Agbakoba, a prominent Nigerian lawyer and human rights activist, had his international passport seized by the State Security Service (SSS, now known as DSS). The seizure was purportedly based on national security concerns or other reasons within the powers of the SSS or the Minister of Internal Affairs. Agbakoba challenged this action, arguing that it infringed upon his constitutional right to freedom of movement as guaranteed under the Constitution of the Federal Republic of Nigeria, 1999. The central issue was whether the right of a Nigerian citizen to hold an international passport is absolute and to what extent the SSS or the Minister of Internal Affairs can restrict such a right under the guise of national security or other legal provisions.\n\nThe case escalated through the judicial system, ultimately reaching the Supreme Court of Nigeria, the highest court in the land, whose decisions are final as per Section 235 of the 1999 Constitution. The legal questions included the scope of the powers of the SSS in restricting fundamental rights and whether such actions were justifiable under the law.\n\n### Judicial Statements\nWhile the HG.org article does not provide direct verbatim quotes from the Supreme Court justices in the case, it highlights the legal principles and constitutional issues that were central to the court's reasoning. The article notes that the case examined the balance between national security interests and individual rights, particularly the right to freedom of movement. The Supreme Court's analysis likely focused on interpreting the relevant constitutional provisions, such as those in Chapter IV of the 1999 Constitution, which guarantees fundamental rights, and any limitations to those rights as provided under Section 45 (which allows for derogations in the interest of defense, public safety, public order, etc.).\n\nIn the absence of direct quotes from the judgment in the source, I must note that the article emphasizes the court's role in determining whether the seizure of Agbakoba's passport was a lawful exercise of power by the SSS or an unconstitutional overreach. The discussion in the article suggests that the court weighed the extent to which the right to hold a passport is tied to the broader right to freedom of movement and whether such a right could be curtailed without due process.\n\n### Decision of the Case\nThe HG.org article indicates that the Supreme Court of Nigeria, being the final arbiter, delivered a decision that addressed the core issues of fundamental human rights versus state powers. While the specific outcome (whether the court ruled in favor of Agbakoba or upheld the SSS's actions) is not explicitly detailed in the summarized content of the article, it is implied that the court's ruling set a precedent on the limits of the powers of the SSS and the Minister of Internal Affairs in restricting a citizen's right to hold an international passport. The decision likely clarified that such rights are not absolute but must be balanced against legitimate state interests, with any restriction requiring a lawful basis and adherence to due process. The finality of the Supreme Court's decision, as reinforced by Section 235 of the 1999 Constitution, means that its ruling in this case serves as binding authority on similar matters.\n\n### Source Citation\nThe information provided above is summarized from the legal article titled *Case Review: Director of SSS v. Agbakoba* published on HG.org. The full article can be accessed at: https://www.hg.org/legal-articles/case-review-director-of-sss-v-agbakoba-27329.\n\n### Note on Limitations\nWhile the HG.org article provides a useful overview of the legal issues and context of the case, it does not include specific details of the Supreme Court's final ruling (e.g., whether Agbakoba's passport was ordered to be returned) or direct excerpts from the judgment. For a more comprehensive analysis, including the exact decision and full judicial reasoning, access to the official Supreme Court judgment or a law report (such as the Nigerian Weekly Law Reports) would be necessary. If you require further assistance in obtaining such primary sources, I can guide you on how to access them through legal databases or libraries in Nigeria.\n\nIf you have any additional questions or need clarification on specific aspects of this case or related legal principles under Nigerian law, I am happy to assist.\n\nSource: https://www.hg.org/legal-articles/case-review-director-of-sss-v-agbakoba-27329"}